; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 15188)
	(= (fuel plane1) 1831)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 13)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city3)
	(= (capacity plane2) 11629)
	(= (fuel plane2) 3396)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 15)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city6)
	(= (capacity plane3) 6978)
	(= (fuel plane3) 2650)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 8)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 5)
	(at plane4 city4)
	(= (capacity plane4) 11759)
	(= (fuel plane4) 300)
	(= (slow-burn plane4) 5)
	(= (fast-burn plane4) 13)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 5)
	(at plane5 city3)
	(= (capacity plane5) 12521)
	(= (fuel plane5) 561)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 11)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 4)
	(at person1 city6)
	(at person2 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 960)
	(= (distance city0 city2) 601)
	(= (distance city0 city3) 754)
	(= (distance city0 city4) 835)
	(= (distance city0 city5) 898)
	(= (distance city0 city6) 929)
	(= (distance city1 city0) 960)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 620)
	(= (distance city1 city3) 528)
	(= (distance city1 city4) 927)
	(= (distance city1 city5) 734)
	(= (distance city1 city6) 820)
	(= (distance city2 city0) 601)
	(= (distance city2 city1) 620)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 772)
	(= (distance city2 city4) 613)
	(= (distance city2 city5) 691)
	(= (distance city2 city6) 711)
	(= (distance city3 city0) 754)
	(= (distance city3 city1) 528)
	(= (distance city3 city2) 772)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 726)
	(= (distance city3 city5) 737)
	(= (distance city3 city6) 862)
	(= (distance city4 city0) 835)
	(= (distance city4 city1) 927)
	(= (distance city4 city2) 613)
	(= (distance city4 city3) 726)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 707)
	(= (distance city4 city6) 758)
	(= (distance city5 city0) 898)
	(= (distance city5 city1) 734)
	(= (distance city5 city2) 691)
	(= (distance city5 city3) 737)
	(= (distance city5 city4) 707)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 710)
	(= (distance city6 city0) 929)
	(= (distance city6 city1) 820)
	(= (distance city6 city2) 711)
	(= (distance city6 city3) 862)
	(= (distance city6 city4) 758)
	(= (distance city6 city5) 710)
	(= (distance city6 city6) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city5)
	(at person2 city3)
	))

(:metric minimize (+ (* 1 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person1 plane3 city6)
   deleted: (at person1 city6)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 2
2. (fly plane3 city6 city5)
   deleted: (at plane3 city6)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 0 to 2130, (fuel plane3) from 2650 to 520
   goals met: 0 of 2
3. (debark person1 plane3 city5)
   deleted: (in person1 plane3)
   added: (at person1 city5)
   changed: (onboard plane3) from 1 to 0
   goals met: 1 of 2
4. (fly plane2 city3 city1)
   deleted: (at plane2 city3)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 2130 to 4770, (fuel plane2) from 3396 to 756
   goals met: 1 of 2
5. (board person2 plane2 city1)
   deleted: (at person2 city1)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 2
6. (refuel plane2 city1)
   changed: (fuel plane2) from 756 to 11629
   goals met: 1 of 2
7. (fly plane2 city1 city3)
   deleted: (at plane2 city1)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 4770 to 7410, (fuel plane2) from 11629 to 8989
   goals met: 1 of 2
8. (debark person2 plane2 city3)
   deleted: (in person2 plane2)
   added: (at person2 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 2
